{"config": {"name": "model_1", "output_layers": [["frames", 0, 0], ["count", 0, 0]], "input_layers": [["video", 0, 0]], "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, null, 64, 64, 2], "sparse": false, "name": "video"}, "name": "video", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "data_format": "channels_last", "name": "conv3d_1", "activation": "relu", "kernel_size": [32, 16, 16], "dilation_rate": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64}, "name": "conv3d_1", "class_name": "Conv3D", "inbound_nodes": [[["video", 0, 0, {}]]]}, {"config": {"trainable": true, "strides": [5, 2, 2], "padding": "valid", "name": "max_pooling3d_1", "data_format": "channels_last", "pool_size": [5, 2, 2]}, "name": "max_pooling3d_1", "class_name": "MaxPooling3D", "inbound_nodes": [[["conv3d_1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "data_format": "channels_last", "name": "conv3d_2", "activation": "relu", "kernel_size": [4, 4, 4], "dilation_rate": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128}, "name": "conv3d_2", "class_name": "Conv3D", "inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "strides": [5, 2, 2], "padding": "valid", "name": "max_pooling3d_2", "data_format": "channels_last", "pool_size": [5, 2, 2]}, "name": "max_pooling3d_2", "class_name": "MaxPooling3D", "inbound_nodes": [[["conv3d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "global_max_pooling3d_1", "data_format": "channels_last"}, "name": "global_max_pooling3d_1", "class_name": "GlobalMaxPooling3D", "inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "units": 512, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_constraint": null}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["global_max_pooling3d_1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "frames", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "units": 128, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "bias_constraint": null}, "name": "frames", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "count", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "units": 1, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "bias_constraint": null}, "name": "count", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Model"}