{"class_name": "Model", "config": {"input_layers": [["video", 0, 0]], "output_layers": [["frames", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 63, 32, 32, 2], "name": "video"}, "inbound_nodes": [], "name": "video"}, {"class_name": "Conv3D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "conv3d_1", "dilation_rate": [1, 1, 1], "activation": "relu", "bias_regularizer": null, "strides": [1, 1, 1], "trainable": true, "data_format": "channels_last", "kernel_size": [8, 8, 8], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "kernel_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["video", 0, 0, {}]]], "name": "conv3d_1"}, {"class_name": "MaxPooling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling3d_1", "pool_size": [5, 2, 2], "strides": [5, 2, 2], "padding": "valid"}, "inbound_nodes": [[["conv3d_1", 0, 0, {}]]], "name": "max_pooling3d_1"}, {"class_name": "Conv3D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "conv3d_2", "dilation_rate": [1, 1, 1], "activation": "relu", "bias_regularizer": null, "strides": [1, 1, 1], "trainable": true, "data_format": "channels_last", "kernel_size": [4, 4, 4], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "kernel_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]], "name": "conv3d_2"}, {"class_name": "MaxPooling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling3d_2", "pool_size": [5, 2, 2], "strides": [5, 2, 2], "padding": "valid"}, "inbound_nodes": [[["conv3d_2", 0, 0, {}]]], "name": "max_pooling3d_2"}, {"class_name": "GlobalMaxPooling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "global_max_pooling3d_1"}, "inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]], "name": "global_max_pooling3d_1"}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "activation": "relu", "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512}, "inbound_nodes": [[["global_max_pooling3d_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "frames", "activation": "sigmoid", "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "frames"}], "name": "model_1"}, "backend": "tensorflow", "keras_version": "2.2.4"}