{"config": {"name": "model_1", "input_layers": [["video", 0, 0]], "output_layers": [["frames", 0, 0]], "layers": [{"name": "video", "config": {"name": "video", "batch_input_shape": [null, 4, 256, 256, 1], "dtype": "float32", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv3d_1", "config": {"filters": 4, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1, 1], "data_format": "channels_last", "kernel_size": [2, 16, 16], "trainable": true, "kernel_regularizer": null, "name": "conv3d_1", "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv3D", "inbound_nodes": [[["video", 0, 0, {}]]]}, {"name": "batch_normalization_1", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "name": "batch_normalization_1", "gamma_regularizer": null, "beta_regularizer": null, "scale": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv3d_1", 0, 0, {}]]]}, {"name": "activation_1", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "max_pooling3d_1", "config": {"name": "max_pooling3d_1", "pool_size": [1, 2, 2], "strides": [1, 2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling3D", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "conv3d_2", "config": {"filters": 8, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1, 1], "data_format": "channels_last", "kernel_size": [2, 8, 8], "trainable": true, "kernel_regularizer": null, "name": "conv3d_2", "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv3D", "inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "name": "batch_normalization_2", "gamma_regularizer": null, "beta_regularizer": null, "scale": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv3d_2", 0, 0, {}]]]}, {"name": "activation_2", "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "max_pooling3d_2", "config": {"name": "max_pooling3d_2", "pool_size": [1, 2, 2], "strides": [1, 2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling3D", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "conv3d_3", "config": {"filters": 16, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1, 1], "data_format": "channels_last", "kernel_size": [1, 4, 4], "trainable": true, "kernel_regularizer": null, "name": "conv3d_3", "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv3D", "inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "name": "batch_normalization_3", "gamma_regularizer": null, "beta_regularizer": null, "scale": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv3d_3", 0, 0, {}]]]}, {"name": "activation_3", "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "max_pooling3d_3", "config": {"name": "max_pooling3d_3", "pool_size": [1, 2, 2], "strides": [1, 2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling3D", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "conv3d_4", "config": {"filters": 32, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1, 1], "data_format": "channels_last", "kernel_size": [1, 3, 3], "trainable": true, "kernel_regularizer": null, "name": "conv3d_4", "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv3D", "inbound_nodes": [[["max_pooling3d_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "name": "batch_normalization_4", "gamma_regularizer": null, "beta_regularizer": null, "scale": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv3d_4", 0, 0, {}]]]}, {"name": "activation_4", "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "max_pooling3d_4", "config": {"name": "max_pooling3d_4", "pool_size": [1, 2, 2], "strides": [1, 2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling3D", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "conv3d_5", "config": {"filters": 64, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1, 1], "data_format": "channels_last", "kernel_size": [1, 3, 3], "trainable": true, "kernel_regularizer": null, "name": "conv3d_5", "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv3D", "inbound_nodes": [[["max_pooling3d_4", 0, 0, {}]]]}, {"name": "batch_normalization_5", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "name": "batch_normalization_5", "gamma_regularizer": null, "beta_regularizer": null, "scale": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv3d_5", 0, 0, {}]]]}, {"name": "activation_5", "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "max_pooling3d_5", "config": {"name": "max_pooling3d_5", "pool_size": [1, 2, 2], "strides": [1, 2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling3D", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "conv3d_6", "config": {"filters": 128, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1, 1], "data_format": "channels_last", "kernel_size": [1, 3, 3], "trainable": true, "kernel_regularizer": null, "name": "conv3d_6", "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv3D", "inbound_nodes": [[["max_pooling3d_5", 0, 0, {}]]]}, {"name": "batch_normalization_6", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "name": "batch_normalization_6", "gamma_regularizer": null, "beta_regularizer": null, "scale": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv3d_6", 0, 0, {}]]]}, {"name": "activation_6", "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "flatten_1", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "dense_1", "config": {"bias_constraint": null, "activation": "relu", "use_bias": true, "units": 256, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "frames", "config": {"bias_constraint": null, "activation": "sigmoid", "use_bias": true, "units": 4, "trainable": true, "kernel_regularizer": null, "name": "frames", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}]}, "class_name": "Model", "keras_version": "2.2.4", "backend": "tensorflow"}