{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"name": "video", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 4, 128, 128, 1], "name": "video"}}, {"name": "conv3d_6", "class_name": "Conv3D", "inbound_nodes": [[["video", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv3d_6", "activation": "linear", "filters": 4, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [2, 16, 16], "strides": [1, 1, 1], "padding": "valid"}}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3d_6", 0, 0, {}]]], "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "center": true, "momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_constraint": null}}, {"name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"name": "max_pooling3d_6", "class_name": "MaxPooling3D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"name": "max_pooling3d_6", "trainable": true, "pool_size": [1, 2, 2], "padding": "valid", "data_format": "channels_last", "strides": [1, 2, 2]}}, {"name": "conv3d_7", "class_name": "Conv3D", "inbound_nodes": [[["max_pooling3d_6", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv3d_7", "activation": "linear", "filters": 8, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [2, 8, 8], "strides": [1, 1, 1], "padding": "valid"}}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3d_7", 0, 0, {}]]], "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "center": true, "momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_constraint": null}}, {"name": "activation_7", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"name": "max_pooling3d_7", "class_name": "MaxPooling3D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"name": "max_pooling3d_7", "trainable": true, "pool_size": [1, 2, 2], "padding": "valid", "data_format": "channels_last", "strides": [1, 2, 2]}}, {"name": "conv3d_8", "class_name": "Conv3D", "inbound_nodes": [[["max_pooling3d_7", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv3d_8", "activation": "linear", "filters": 16, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [1, 4, 4], "strides": [1, 1, 1], "padding": "valid"}}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3d_8", 0, 0, {}]]], "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "center": true, "momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_constraint": null}}, {"name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"name": "max_pooling3d_8", "class_name": "MaxPooling3D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"name": "max_pooling3d_8", "trainable": true, "pool_size": [1, 2, 2], "padding": "valid", "data_format": "channels_last", "strides": [1, 2, 2]}}, {"name": "conv3d_9", "class_name": "Conv3D", "inbound_nodes": [[["max_pooling3d_8", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv3d_9", "activation": "linear", "filters": 32, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [1, 3, 3], "strides": [1, 1, 1], "padding": "valid"}}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3d_9", 0, 0, {}]]], "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_9", "center": true, "momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_constraint": null}}, {"name": "activation_9", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"name": "max_pooling3d_9", "class_name": "MaxPooling3D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"name": "max_pooling3d_9", "trainable": true, "pool_size": [1, 2, 2], "padding": "valid", "data_format": "channels_last", "strides": [1, 2, 2]}}, {"name": "conv3d_10", "class_name": "Conv3D", "inbound_nodes": [[["max_pooling3d_9", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv3d_10", "activation": "linear", "filters": 64, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [1, 3, 3], "strides": [1, 1, 1], "padding": "valid"}}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3d_10", 0, 0, {}]]], "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_10", "center": true, "momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_constraint": null}}, {"name": "activation_10", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"name": "max_pooling3d_10", "class_name": "MaxPooling3D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"name": "max_pooling3d_10", "trainable": true, "pool_size": [1, 2, 2], "padding": "valid", "data_format": "channels_last", "strides": [1, 2, 2]}}, {"name": "flatten_2", "class_name": "Flatten", "inbound_nodes": [[["max_pooling3d_10", 0, 0, {}]]], "config": {"name": "flatten_2", "trainable": true, "data_format": "channels_last"}}, {"name": "frames", "class_name": "Dense", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "config": {"units": 4, "name": "frames", "activation": "softmax", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null}}], "name": "model_4", "input_layers": [["video", 0, 0]], "output_layers": [["frames", 0, 0]]}}