{"backend": "tensorflow", "class_name": "Model", "config": {"name": "model_1", "output_layers": [["frames", 0, 0]], "input_layers": [["video", 0, 0]], "layers": [{"name": "video", "class_name": "InputLayer", "config": {"name": "video", "batch_input_shape": [null, 32, 64, 64, 3], "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "conv3d_1", "class_name": "Conv3D", "config": {"activation": "relu", "dilation_rate": [1, 1, 1], "bias_constraint": null, "kernel_size": [8, 8, 8], "padding": "valid", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "name": "conv3d_1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["video", 0, 0, {}]]]}, {"name": "max_pooling3d_1", "class_name": "MaxPooling3D", "config": {"data_format": "channels_last", "pool_size": [5, 2, 2], "strides": [5, 2, 2], "trainable": true, "name": "max_pooling3d_1", "padding": "valid"}, "inbound_nodes": [[["conv3d_1", 0, 0, {}]]]}, {"name": "conv3d_2", "class_name": "Conv3D", "config": {"activation": "relu", "dilation_rate": [1, 1, 1], "bias_constraint": null, "kernel_size": [3, 3, 3], "padding": "valid", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1, 1], "use_bias": true, "name": "conv3d_2", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]]}, {"name": "max_pooling3d_2", "class_name": "MaxPooling3D", "config": {"data_format": "channels_last", "pool_size": [1, 2, 2], "strides": [5, 2, 2], "trainable": true, "name": "max_pooling3d_2", "padding": "valid"}, "inbound_nodes": [[["conv3d_2", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "kernel_constraint": null, "units": 512, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "frames", "class_name": "Dense", "config": {"activation": "sigmoid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "frames", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "kernel_constraint": null, "units": 32, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}]}, "keras_version": "2.2.4"}