{"config": {"layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 4, 128, 128, 2], "sparse": false, "name": "video", "dtype": "float32"}, "name": "video", "class_name": "InputLayer"}, {"inbound_nodes": [[["video", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "dilation_rate": [1, 1, 1], "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "strides": [1, 1, 1], "kernel_regularizer": null, "name": "conv3d_1", "kernel_size": [2, 16, 16], "filters": 4, "use_bias": true, "kernel_constraint": null}, "name": "conv3d_1", "class_name": "Conv3D"}, {"inbound_nodes": [[["conv3d_1", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null, "axis": -1, "gamma_constraint": null, "scale": true, "trainable": true, "name": "batch_normalization_1", "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "batch_normalization_1", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "name": "activation_1", "class_name": "Activation"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"strides": [1, 2, 2], "trainable": true, "name": "max_pooling3d_1", "pool_size": [1, 2, 2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling3d_1", "class_name": "MaxPooling3D"}, {"inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "dilation_rate": [1, 1, 1], "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "strides": [1, 1, 1], "kernel_regularizer": null, "name": "conv3d_2", "kernel_size": [2, 8, 8], "filters": 8, "use_bias": true, "kernel_constraint": null}, "name": "conv3d_2", "class_name": "Conv3D"}, {"inbound_nodes": [[["conv3d_2", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null, "axis": -1, "gamma_constraint": null, "scale": true, "trainable": true, "name": "batch_normalization_2", "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "batch_normalization_2", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "name": "activation_2", "class_name": "Activation"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"strides": [1, 2, 2], "trainable": true, "name": "max_pooling3d_2", "pool_size": [1, 2, 2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling3d_2", "class_name": "MaxPooling3D"}, {"inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "dilation_rate": [1, 1, 1], "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "strides": [1, 1, 1], "kernel_regularizer": null, "name": "conv3d_3", "kernel_size": [1, 4, 4], "filters": 16, "use_bias": true, "kernel_constraint": null}, "name": "conv3d_3", "class_name": "Conv3D"}, {"inbound_nodes": [[["conv3d_3", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null, "axis": -1, "gamma_constraint": null, "scale": true, "trainable": true, "name": "batch_normalization_3", "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "batch_normalization_3", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "name": "activation_3", "class_name": "Activation"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"strides": [1, 2, 2], "trainable": true, "name": "max_pooling3d_3", "pool_size": [1, 2, 2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling3d_3", "class_name": "MaxPooling3D"}, {"inbound_nodes": [[["max_pooling3d_3", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "dilation_rate": [1, 1, 1], "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "strides": [1, 1, 1], "kernel_regularizer": null, "name": "conv3d_4", "kernel_size": [1, 3, 3], "filters": 32, "use_bias": true, "kernel_constraint": null}, "name": "conv3d_4", "class_name": "Conv3D"}, {"inbound_nodes": [[["conv3d_4", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null, "axis": -1, "gamma_constraint": null, "scale": true, "trainable": true, "name": "batch_normalization_4", "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "batch_normalization_4", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "name": "activation_4", "class_name": "Activation"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"strides": [1, 2, 2], "trainable": true, "name": "max_pooling3d_4", "pool_size": [1, 2, 2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling3d_4", "class_name": "MaxPooling3D"}, {"inbound_nodes": [[["max_pooling3d_4", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "dilation_rate": [1, 1, 1], "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "strides": [1, 1, 1], "kernel_regularizer": null, "name": "conv3d_5", "kernel_size": [1, 3, 3], "filters": 64, "use_bias": true, "kernel_constraint": null}, "name": "conv3d_5", "class_name": "Conv3D"}, {"inbound_nodes": [[["conv3d_5", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null, "axis": -1, "gamma_constraint": null, "scale": true, "trainable": true, "name": "batch_normalization_5", "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "batch_normalization_5", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "name": "activation_5", "class_name": "Activation"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"strides": [1, 2, 2], "trainable": true, "name": "max_pooling3d_5", "pool_size": [1, 2, 2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling3d_5", "class_name": "MaxPooling3D"}, {"inbound_nodes": [[["max_pooling3d_5", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "name": "flatten_1", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "name": "dense_1", "bias_regularizer": null, "units": 256, "use_bias": true}, "name": "dense_1", "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "softmax", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "name": "frames", "bias_regularizer": null, "units": 5, "use_bias": true}, "name": "frames", "class_name": "Dense"}], "input_layers": [["video", 0, 0]], "name": "model_1", "output_layers": [["frames", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4"}