{"keras_version": "2.2.4", "config": {"input_layers": [["video", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "name": "video", "config": {"batch_input_shape": [null, null, 32, 32, 2], "dtype": "float32", "name": "video", "sparse": false}, "class_name": "InputLayer"}, {"inbound_nodes": [[["video", 0, 0, {}]]], "name": "conv3d_1", "config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "trainable": true, "bias_constraint": null, "strides": [1, 1, 1], "use_bias": true, "dilation_rate": [1, 1, 1], "padding": "valid", "name": "conv3d_1", "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [16, 8, 8], "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Conv3D"}, {"inbound_nodes": [[["conv3d_1", 0, 0, {}]]], "name": "max_pooling3d_1", "config": {"pool_size": [5, 2, 2], "name": "max_pooling3d_1", "data_format": "channels_last", "trainable": true, "strides": [5, 2, 2], "padding": "valid"}, "class_name": "MaxPooling3D"}, {"inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]], "name": "conv3d_2", "config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "trainable": true, "bias_constraint": null, "strides": [1, 1, 1], "use_bias": true, "dilation_rate": [1, 1, 1], "padding": "valid", "name": "conv3d_2", "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4, 4], "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Conv3D"}, {"inbound_nodes": [[["conv3d_2", 0, 0, {}]]], "name": "max_pooling3d_2", "config": {"pool_size": [5, 2, 2], "name": "max_pooling3d_2", "data_format": "channels_last", "trainable": true, "strides": [5, 2, 2], "padding": "valid"}, "class_name": "MaxPooling3D"}, {"inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]], "name": "conv3d_3", "config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "trainable": true, "bias_constraint": null, "strides": [1, 1, 1], "use_bias": true, "dilation_rate": [1, 1, 1], "padding": "valid", "name": "conv3d_3", "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [2, 2, 2], "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Conv3D"}, {"inbound_nodes": [[["conv3d_3", 0, 0, {}]]], "name": "max_pooling3d_3", "config": {"pool_size": [2, 2, 2], "name": "max_pooling3d_3", "data_format": "channels_last", "trainable": true, "strides": [1, 2, 2], "padding": "valid"}, "class_name": "MaxPooling3D"}, {"inbound_nodes": [[["max_pooling3d_3", 0, 0, {}]]], "name": "global_max_pooling3d_1", "config": {"name": "global_max_pooling3d_1", "data_format": "channels_last", "trainable": true}, "class_name": "GlobalMaxPooling3D"}, {"inbound_nodes": [[["global_max_pooling3d_1", 0, 0, {}]]], "name": "dense_1", "config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "units": 512, "name": "dense_1", "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "frames", "config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "units": 128, "name": "frames", "bias_regularizer": null, "trainable": true, "activation": "sigmoid", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}], "output_layers": [["frames", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}