{"config": {"output_layers": [["frames", 0, 0], ["count", 0, 0]], "name": "model_1", "layers": [{"config": {"dtype": "float32", "name": "video", "batch_input_shape": [null, null, 64, 64, 2], "sparse": false}, "inbound_nodes": [], "name": "video", "class_name": "InputLayer"}, {"config": {"bias_constraint": null, "data_format": "channels_last", "kernel_size": [32, 16, 16], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv3d_1", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1, 1], "activity_regularizer": null, "strides": [1, 1, 1], "activation": "linear", "trainable": true, "padding": "valid", "kernel_constraint": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["video", 0, 0, {}]]], "name": "conv3d_1", "class_name": "Conv3D"}, {"config": {"data_format": "channels_last", "strides": [5, 2, 2], "trainable": true, "pool_size": [5, 2, 2], "padding": "valid", "name": "max_pooling3d_1"}, "inbound_nodes": [[["conv3d_1", 0, 0, {}]]], "name": "max_pooling3d_1", "class_name": "MaxPooling3D"}, {"config": {"bias_constraint": null, "data_format": "channels_last", "kernel_size": [4, 4, 4], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv3d_2", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1, 1], "activity_regularizer": null, "strides": [1, 1, 1], "activation": "relu", "trainable": true, "padding": "valid", "kernel_constraint": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]], "name": "conv3d_2", "class_name": "Conv3D"}, {"config": {"data_format": "channels_last", "strides": [5, 2, 2], "trainable": true, "pool_size": [5, 2, 2], "padding": "valid", "name": "max_pooling3d_2"}, "inbound_nodes": [[["conv3d_2", 0, 0, {}]]], "name": "max_pooling3d_2", "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "global_max_pooling3d_1"}, "inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]], "name": "global_max_pooling3d_1", "class_name": "GlobalMaxPooling3D"}, {"config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "units": 512, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["global_max_pooling3d_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "units": 128, "name": "frames", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "frames", "class_name": "Dense"}, {"config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "units": 1, "name": "count", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "count", "class_name": "Dense"}], "input_layers": [["video", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Model"}