{"config": {"layers": [{"config": {"dtype": "float32", "name": "video", "sparse": false, "batch_input_shape": [null, 4, 256, 256, 2]}, "class_name": "InputLayer", "name": "video", "inbound_nodes": []}, {"config": {"strides": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 4, "padding": "valid", "activation": "linear", "activity_regularizer": null, "name": "conv3d_1", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [2, 16, 16], "kernel_regularizer": null}, "class_name": "Conv3D", "name": "conv3d_1", "inbound_nodes": [[["video", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "name": "batch_normalization_1", "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv3d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"config": {"strides": [1, 2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling3d_1", "pool_size": [1, 2, 2]}, "class_name": "MaxPooling3D", "name": "max_pooling3d_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"config": {"strides": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 8, "padding": "valid", "activation": "linear", "activity_regularizer": null, "name": "conv3d_2", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [2, 8, 8], "kernel_regularizer": null}, "class_name": "Conv3D", "name": "conv3d_2", "inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "name": "batch_normalization_2", "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv3d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"config": {"strides": [1, 2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling3d_2", "pool_size": [1, 2, 2]}, "class_name": "MaxPooling3D", "name": "max_pooling3d_2", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"config": {"strides": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "padding": "valid", "activation": "linear", "activity_regularizer": null, "name": "conv3d_3", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 4, 4], "kernel_regularizer": null}, "class_name": "Conv3D", "name": "conv3d_3", "inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "name": "batch_normalization_3", "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv3d_3", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"config": {"strides": [1, 2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling3d_3", "pool_size": [1, 2, 2]}, "class_name": "MaxPooling3D", "name": "max_pooling3d_3", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"config": {"strides": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "padding": "valid", "activation": "linear", "activity_regularizer": null, "name": "conv3d_4", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 3, 3], "kernel_regularizer": null}, "class_name": "Conv3D", "name": "conv3d_4", "inbound_nodes": [[["max_pooling3d_3", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "name": "batch_normalization_4", "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv3d_4", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"config": {"strides": [1, 2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling3d_4", "pool_size": [1, 2, 2]}, "class_name": "MaxPooling3D", "name": "max_pooling3d_4", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"config": {"strides": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "padding": "valid", "activation": "linear", "activity_regularizer": null, "name": "conv3d_5", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 3, 3], "kernel_regularizer": null}, "class_name": "Conv3D", "name": "conv3d_5", "inbound_nodes": [[["max_pooling3d_4", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "name": "batch_normalization_5", "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["conv3d_5", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"config": {"strides": [1, 2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling3d_5", "pool_size": [1, 2, 2]}, "class_name": "MaxPooling3D", "name": "max_pooling3d_5", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"config": {"strides": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "padding": "valid", "activation": "linear", "activity_regularizer": null, "name": "conv3d_6", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 3, 3], "kernel_regularizer": null}, "class_name": "Conv3D", "name": "conv3d_6", "inbound_nodes": [[["max_pooling3d_5", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "name": "batch_normalization_6", "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["conv3d_6", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"config": {"strides": [1, 2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling3d_6", "pool_size": [1, 2, 2]}, "class_name": "MaxPooling3D", "name": "max_pooling3d_6", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["max_pooling3d_6", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 256, "activation": "relu", "activity_regularizer": null, "name": "dense_1", "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 1, "activation": "sigmoid", "activity_regularizer": null, "name": "frames", "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense", "name": "frames", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "input_layers": [["video", 0, 0]], "name": "model_1", "output_layers": [["frames", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4"}