{"config": {"output_layers": [["frames", 0, 0]], "name": "model_1", "layers": [{"config": {"batch_input_shape": [null, 32, 32, 32, 3], "name": "video", "sparse": false, "dtype": "float32"}, "name": "video", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"data_format": "channels_last", "name": "conv3d_1", "strides": [1, 1, 1], "trainable": true, "dilation_rate": [1, 1, 1], "filters": 32, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu", "kernel_size": [8, 8, 8], "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_1", "inbound_nodes": [[["video", 0, 0, {}]]], "class_name": "Conv3D"}, {"config": {"name": "max_pooling3d_1", "strides": [4, 2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [4, 2, 2]}, "name": "max_pooling3d_1", "inbound_nodes": [[["conv3d_1", 0, 0, {}]]], "class_name": "MaxPooling3D"}, {"config": {"data_format": "channels_last", "name": "conv3d_2", "strides": [1, 1, 1], "trainable": true, "dilation_rate": [1, 1, 1], "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu", "kernel_size": [4, 4, 4], "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_2", "inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]], "class_name": "Conv3D"}, {"config": {"name": "max_pooling3d_2", "strides": [3, 2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [3, 2, 2]}, "name": "max_pooling3d_2", "inbound_nodes": [[["conv3d_2", 0, 0, {}]]], "class_name": "MaxPooling3D"}, {"config": {"name": "dense_1", "units": 256, "trainable": true, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}, "name": "dense_1", "inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"name": "dense_2", "units": 512, "trainable": true, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "name": "flatten_1", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Flatten"}, {"config": {"name": "frames", "units": 32, "trainable": true, "activation": "sigmoid", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}, "name": "frames", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["video", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Model"}