{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 128, 128, 1], "dtype": "float32", "name": "video", "sparse": false}, "inbound_nodes": [], "name": "video"}, {"class_name": "Conv3D", "config": {"activity_regularizer": null, "activation": "linear", "kernel_size": [2, 16, 16], "name": "conv3d_1", "kernel_regularizer": null, "bias_constraint": null, "filters": 4, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "strides": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["video", 0, 0, {}]]], "name": "conv3d_1"}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv3d_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_1", "pool_size": [1, 2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [1, 2, 2]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "max_pooling3d_1"}, {"class_name": "Conv3D", "config": {"activity_regularizer": null, "activation": "linear", "kernel_size": [2, 8, 8], "name": "conv3d_2", "kernel_regularizer": null, "bias_constraint": null, "filters": 8, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "strides": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]], "name": "conv3d_2"}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv3d_2", 0, 0, {}]]], "name": "batch_normalization_2"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_2", "pool_size": [1, 2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [1, 2, 2]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "max_pooling3d_2"}, {"class_name": "Conv3D", "config": {"activity_regularizer": null, "activation": "linear", "kernel_size": [1, 4, 4], "name": "conv3d_3", "kernel_regularizer": null, "bias_constraint": null, "filters": 16, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "strides": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]], "name": "conv3d_3"}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv3d_3", 0, 0, {}]]], "name": "batch_normalization_3"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_3"}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_3", "pool_size": [1, 2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [1, 2, 2]}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "max_pooling3d_3"}, {"class_name": "Conv3D", "config": {"activity_regularizer": null, "activation": "linear", "kernel_size": [1, 3, 3], "name": "conv3d_4", "kernel_regularizer": null, "bias_constraint": null, "filters": 32, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "strides": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["max_pooling3d_3", 0, 0, {}]]], "name": "conv3d_4"}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv3d_4", 0, 0, {}]]], "name": "batch_normalization_4"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4"}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_4", "pool_size": [1, 2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [1, 2, 2]}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "max_pooling3d_4"}, {"class_name": "Conv3D", "config": {"activity_regularizer": null, "activation": "linear", "kernel_size": [1, 3, 3], "name": "conv3d_5", "kernel_regularizer": null, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "strides": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["max_pooling3d_4", 0, 0, {}]]], "name": "conv3d_5"}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv3d_5", 0, 0, {}]]], "name": "batch_normalization_5"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "activation_5"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "sigmoid", "units": 4, "name": "frames", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "frames"}], "input_layers": [["video", 0, 0]], "name": "model_1", "output_layers": [["frames", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.4"}