{"keras_version": "2.2.4", "config": {"input_layers": [["video", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 4, 64, 64, 3], "dtype": "float32", "sparse": false, "name": "video"}, "inbound_nodes": [], "name": "video", "class_name": "InputLayer"}, {"config": {"trainable": true, "layer": {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "filters": 32, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_size": [16, 16], "activation": "linear", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, "name": "time_distributed_1"}, "inbound_nodes": [[["video", 0, 0, {}]]], "name": "time_distributed_1", "class_name": "TimeDistributed"}, {"config": {"scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "center": true, "gamma_constraint": null, "name": "batch_normalization_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "name": "batch_normalization_1", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "class_name": "Activation"}, {"config": {"trainable": true, "layer": {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "filters": 64, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_size": [8, 8], "activation": "linear", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, "name": "time_distributed_2"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "time_distributed_2", "class_name": "TimeDistributed"}, {"config": {"scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "center": true, "gamma_constraint": null, "name": "batch_normalization_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]], "name": "batch_normalization_2", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "class_name": "Activation"}, {"config": {"trainable": true, "layer": {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "filters": 128, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_size": [4, 4], "activation": "linear", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, "name": "time_distributed_3"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "time_distributed_3", "class_name": "TimeDistributed"}, {"config": {"scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "center": true, "gamma_constraint": null, "name": "batch_normalization_3", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["time_distributed_3", 0, 0, {}]]], "name": "batch_normalization_3", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_3", "class_name": "Activation"}, {"config": {"trainable": true, "layer": {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_4", "filters": 256, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_size": [2, 2], "activation": "linear", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, "name": "time_distributed_4"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "time_distributed_4", "class_name": "TimeDistributed"}, {"config": {"scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "center": true, "gamma_constraint": null, "name": "batch_normalization_4", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["time_distributed_4", 0, 0, {}]]], "name": "batch_normalization_4", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4", "class_name": "Activation"}, {"config": {"trainable": true, "layer": {"config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, "name": "time_distributed_5"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "time_distributed_5", "class_name": "TimeDistributed"}, {"config": {"trainable": true, "layer": {"config": {"bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, "name": "time_distributed_6"}, "inbound_nodes": [[["time_distributed_5", 0, 0, {}]]], "name": "time_distributed_6", "class_name": "TimeDistributed"}, {"config": {"trainable": true, "layer": {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, "name": "time_distributed_7"}, "inbound_nodes": [[["time_distributed_6", 0, 0, {}]]], "name": "time_distributed_7", "class_name": "TimeDistributed"}, {"config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "implementation": 1, "bias_regularizer": null, "recurrent_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "stateful": false, "units": 100, "activation": "tanh", "use_bias": true, "kernel_regularizer": null, "return_state": false, "return_sequences": false, "unroll": false, "dropout": 0.0, "unit_forget_bias": true, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["time_distributed_7", 0, 0, {}]]], "name": "lstm_1", "class_name": "LSTM"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "frames", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 4, "activation": "sigmoid", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "name": "frames", "class_name": "Dense"}], "name": "model_1", "output_layers": [["frames", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}