{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"output_layers": [["frames", 0, 0]], "name": "model_1", "input_layers": [["video", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 32, 3], "sparse": false, "name": "video", "dtype": "float32"}, "name": "video", "inbound_nodes": []}, {"class_name": "Conv3D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "filters": 32, "strides": [1, 1, 1], "kernel_size": [8, 8, 8], "dilation_rate": [1, 1, 1], "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "name": "conv3d_1", "padding": "valid", "trainable": true, "use_bias": true}, "name": "conv3d_1", "inbound_nodes": [[["video", 0, 0, {}]]]}, {"class_name": "MaxPooling3D", "config": {"data_format": "channels_last", "name": "max_pooling3d_1", "strides": [5, 2, 2], "pool_size": [5, 2, 2], "padding": "valid", "trainable": true}, "name": "max_pooling3d_1", "inbound_nodes": [[["conv3d_1", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "filters": 64, "strides": [1, 1, 1], "kernel_size": [3, 3, 3], "dilation_rate": [1, 1, 1], "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "name": "conv3d_2", "padding": "valid", "trainable": true, "use_bias": true}, "name": "conv3d_2", "inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling3D", "config": {"data_format": "channels_last", "name": "max_pooling3d_2", "strides": [5, 2, 2], "pool_size": [1, 2, 2], "padding": "valid", "trainable": true}, "name": "max_pooling3d_2", "inbound_nodes": [[["conv3d_2", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling3D", "config": {"data_format": "channels_last", "name": "global_max_pooling3d_1", "trainable": true}, "name": "global_max_pooling3d_1", "inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 512, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "use_bias": true}, "name": "dense_1", "inbound_nodes": [[["global_max_pooling3d_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 32, "activation": "sigmoid", "activity_regularizer": null, "kernel_constraint": null, "name": "frames", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "use_bias": true}, "name": "frames", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}]}}