{"config": {"name": "model_1", "layers": [{"name": "video", "config": {"name": "video", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 3, 256, 256, 2]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv3d_1", "config": {"filters": 8, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "conv3d_1", "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "padding": "valid", "strides": [1, 1, 1], "kernel_size": [2, 16, 16], "bias_constraint": null}, "class_name": "Conv3D", "inbound_nodes": [[["video", 0, 0, {}]]]}, {"name": "batch_normalization_1", "config": {"center": true, "epsilon": 0.001, "name": "batch_normalization_1", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv3d_1", 0, 0, {}]]]}, {"name": "activation_1", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "max_pooling3d_1", "config": {"name": "max_pooling3d_1", "padding": "valid", "trainable": true, "strides": [1, 2, 2], "pool_size": [1, 2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling3D", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "conv3d_2", "config": {"filters": 16, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "conv3d_2", "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "padding": "valid", "strides": [1, 1, 1], "kernel_size": [2, 8, 8], "bias_constraint": null}, "class_name": "Conv3D", "inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "config": {"center": true, "epsilon": 0.001, "name": "batch_normalization_2", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv3d_2", 0, 0, {}]]]}, {"name": "activation_2", "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "max_pooling3d_2", "config": {"name": "max_pooling3d_2", "padding": "valid", "trainable": true, "strides": [1, 2, 2], "pool_size": [1, 2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling3D", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "conv3d_3", "config": {"filters": 32, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "conv3d_3", "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "padding": "valid", "strides": [1, 1, 1], "kernel_size": [1, 4, 4], "bias_constraint": null}, "class_name": "Conv3D", "inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "config": {"center": true, "epsilon": 0.001, "name": "batch_normalization_3", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv3d_3", 0, 0, {}]]]}, {"name": "activation_3", "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "max_pooling3d_3", "config": {"name": "max_pooling3d_3", "padding": "valid", "trainable": true, "strides": [1, 2, 2], "pool_size": [1, 2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling3D", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "conv3d_4", "config": {"filters": 64, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "conv3d_4", "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "padding": "valid", "strides": [1, 1, 1], "kernel_size": [1, 3, 3], "bias_constraint": null}, "class_name": "Conv3D", "inbound_nodes": [[["max_pooling3d_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "config": {"center": true, "epsilon": 0.001, "name": "batch_normalization_4", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv3d_4", 0, 0, {}]]]}, {"name": "activation_4", "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "max_pooling3d_4", "config": {"name": "max_pooling3d_4", "padding": "valid", "trainable": true, "strides": [1, 2, 2], "pool_size": [1, 2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling3D", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "conv3d_5", "config": {"filters": 128, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "conv3d_5", "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "padding": "valid", "strides": [1, 1, 1], "kernel_size": [1, 3, 3], "bias_constraint": null}, "class_name": "Conv3D", "inbound_nodes": [[["max_pooling3d_4", 0, 0, {}]]]}, {"name": "batch_normalization_5", "config": {"center": true, "epsilon": 0.001, "name": "batch_normalization_5", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv3d_5", 0, 0, {}]]]}, {"name": "activation_5", "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "max_pooling3d_5", "config": {"name": "max_pooling3d_5", "padding": "valid", "trainable": true, "strides": [1, 2, 2], "pool_size": [1, 2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling3D", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "conv3d_6", "config": {"filters": 256, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "conv3d_6", "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "padding": "valid", "strides": [1, 1, 1], "kernel_size": [1, 3, 3], "bias_constraint": null}, "class_name": "Conv3D", "inbound_nodes": [[["max_pooling3d_5", 0, 0, {}]]]}, {"name": "batch_normalization_6", "config": {"center": true, "epsilon": 0.001, "name": "batch_normalization_6", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv3d_6", 0, 0, {}]]]}, {"name": "activation_6", "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "max_pooling3d_6", "config": {"name": "max_pooling3d_6", "padding": "valid", "trainable": true, "strides": [1, 2, 2], "pool_size": [1, 2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling3D", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten", "inbound_nodes": [[["max_pooling3d_6", 0, 0, {}]]]}, {"name": "dense_1", "config": {"bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_1", "units": 128, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "frames", "config": {"bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "frames", "units": 1, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "bias_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "input_layers": [["video", 0, 0]], "output_layers": [["frames", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Model"}