{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4", "config": {"name": "model_1", "layers": [{"name": "video", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "video", "batch_input_shape": [null, null, 32, 32, 2], "sparse": false, "dtype": "float32"}}, {"name": "conv3d_1", "class_name": "Conv3D", "inbound_nodes": [[["video", 0, 0, {}]]], "config": {"dilation_rate": [1, 1, 1], "bias_regularizer": null, "strides": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "name": "conv3d_1", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 64, "activation": "relu", "kernel_regularizer": null, "kernel_size": [32, 8, 8], "trainable": true, "kernel_constraint": null}}, {"name": "max_pooling3d_1", "class_name": "MaxPooling3D", "inbound_nodes": [[["conv3d_1", 0, 0, {}]]], "config": {"name": "max_pooling3d_1", "trainable": true, "strides": [5, 2, 2], "pool_size": [5, 2, 2], "padding": "valid", "data_format": "channels_last"}}, {"name": "conv3d_2", "class_name": "Conv3D", "inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1, 1], "bias_regularizer": null, "strides": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "name": "conv3d_2", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 128, "activation": "relu", "kernel_regularizer": null, "kernel_size": [4, 4, 4], "trainable": true, "kernel_constraint": null}}, {"name": "max_pooling3d_2", "class_name": "MaxPooling3D", "inbound_nodes": [[["conv3d_2", 0, 0, {}]]], "config": {"name": "max_pooling3d_2", "trainable": true, "strides": [5, 2, 2], "pool_size": [5, 2, 2], "padding": "valid", "data_format": "channels_last"}}, {"name": "global_max_pooling3d_1", "class_name": "GlobalMaxPooling3D", "inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]], "config": {"name": "global_max_pooling3d_1", "trainable": true, "data_format": "channels_last"}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["global_max_pooling3d_1", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true}}, {"name": "frames", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"use_bias": true, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "name": "frames", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true}}, {"name": "count", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"use_bias": true, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "name": "count", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true}}], "input_layers": [["video", 0, 0]], "output_layers": [["frames", 0, 0], ["count", 0, 0]]}}