{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "model_1", "layers": [{"name": "video", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "video", "dtype": "float32", "batch_input_shape": [null, 32, 32, 32, 3], "sparse": false}}, {"name": "conv3d_1", "class_name": "Conv3D", "inbound_nodes": [[["video", 0, 0, {}]]], "config": {"data_format": "channels_last", "use_bias": true, "dilation_rate": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "kernel_size": [8, 8, 8], "kernel_constraint": null, "activity_regularizer": null, "name": "conv3d_1", "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true}}, {"name": "max_pooling3d_1", "class_name": "MaxPooling3D", "inbound_nodes": [[["conv3d_1", 0, 0, {}]]], "config": {"name": "max_pooling3d_1", "data_format": "channels_last", "pool_size": [5, 2, 2], "strides": [5, 2, 2], "padding": "valid", "trainable": true}}, {"name": "conv3d_2", "class_name": "Conv3D", "inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "use_bias": true, "dilation_rate": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "kernel_size": [3, 3, 3], "kernel_constraint": null, "activity_regularizer": null, "name": "conv3d_2", "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true}}, {"name": "max_pooling3d_2", "class_name": "MaxPooling3D", "inbound_nodes": [[["conv3d_2", 0, 0, {}]]], "config": {"name": "max_pooling3d_2", "data_format": "channels_last", "pool_size": [1, 2, 2], "strides": [5, 2, 2], "padding": "valid", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]], "config": {"activation": "relu", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "units": 512, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"name": "frames", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"activation": "sigmoid", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "units": 32, "kernel_constraint": null, "activity_regularizer": null, "name": "frames", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true}}], "input_layers": [["video", 0, 0]], "output_layers": [["frames", 0, 0]]}}